8.Ladenburg nozzle jet/HLLC/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChangeTwoPhaseModel HRM;

HRMCoeffs
{
    theta0          		 1e-9; //standard kappa 1e-10 will break
    powerAlpha          	-0.54;
    powerPnorm    			-1.76;
    condensationTimeFactor   5000;
    pnormMin          		 1e-4;
}


// ************************************************************************* //
