8.Ladenburg nozzle jet/HLLC/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;  
	format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
        {
            
			box (0.0005 -0.000 -1) (0.001 0.0005 1);
		}
        
    }
    {
        name    c0;
        type    cellSet;
        action  add;
        source  boxToCell;
		sourceInfo
        {
            
			box (0.001 -0.0015 -1) (0.0063 0.003 1);
		}
        
    }
);

// ************************************************************************* //
